<?php
/*
 * Shoputils
 *
 * ПРИМЕЧАНИЕ К ЛИЦЕНЗИОННОМУ СОГЛАШЕНИЮ
 *
 * Этот файл связан лицензионным соглашением, которое можно найти в архиве,
 * вместе с этим файлом. Файл лицензии называется: LICENSE.2.x.RUS.TXT
 * Так же лицензионное соглашение можно найти по адресу:
 * http://opencart.shoputils.ru/LICENSE.2.x.RUS.TXT
 * 
 * =================================================================
 * OPENCART/ocStore 2.x ПРИМЕЧАНИЕ ПО ИСПОЛЬЗОВАНИЮ
 * =================================================================
 *  Этот файл предназначен для Opencart/ocStore 2.x. Shoputils не
 *  гарантирует правильную работу этого расширения на любой другой 
 *  версии Opencart/ocStore, кроме Opencart/ocStore 2.x. 
 *  Shoputils не поддерживает программное обеспечение для других 
 *  версий Opencart/ocStore.
 * =================================================================
*/

// Heading
$_['heading_title']           = 'Шаблоны писем, v2.3';

// Menu
$_['menu_mail_order_status']  = 'Шаблоны писем';

// Tab 
$_['tab_new_order']           = 'Новый заказ';
$_['tab_order_statuses']      = 'Статусы заказов';
$_['tab_settings_ft']         = 'Настройки переменных';

// Button 
$_['button_default']          = 'Восстановить по умолчанию';

// Text 
$_['text_success']            = 'Шаблоны писем обновлены!';
$_['text_confirm']            = 'Существующие данные в этих полях будут заменены на дефолтные! Вы уверены, что хотите это сделать?';
$_['text_copyright']      	  = 'Модуль "%s" разработан <a href="https://opencartforum.com/user/3463-shoputils/" target="_blank">ShopUtils</a>. Вопросы по техподдержке и работе модуля отправляйте через сайт <a href="http://opencart.shoputils.ru/?route=information/contact" target="_blank">http://opencart.shoputils.ru</a>.<br />&copy; ShopUtils 2010 &mdash; %s';
$_['text_info']               = 'При добавлении нового статуса заказа ("<a href="%s" target="_blank">Система -> Локализация -> Статусы заказов</a>") новый статус заказа появится здесь автоматически.';
$_['text_new_subject_default']      = '{store_name} - заказ {order_id}';

$_['text_products_header']          = 'Шапка товаров';
$_['text_products_image']           = 'Изображение товара';
$_['text_products_name']            = 'Название товара';
$_['text_products_href']            = 'href товара (неактивная ссылка)';
$_['text_products_model']           = 'Модель товара';
$_['text_products_sku']             = 'Артикул товара (SKU)';
$_['text_products_upc']             = 'UPC';
$_['text_products_ean']             = 'EAN';
$_['text_products_jan']             = 'JAN';
$_['text_products_isbn']            = 'ISBN';
$_['text_products_mpn']             = 'MPN';
$_['text_products_manufacturer']    = 'Производитель товара';
$_['text_products_quantity']        = 'Количество товара';
$_['text_products_price']           = 'Цена товара';
$_['text_products_total']           = 'Сумма (Цена * К-во) товара';
$_['text_products_reward']          = 'Бонусные баллы';
$_['text_products_footer']          = 'Подвал товаров';
$_['text_products_warning']         = 'Внимание! Некоторые переменные на версиях Opencart/ocStore 1.5.3.1 и ниже работать не будут';
$_['text_totals_title']             = 'Заголовок';
$_['text_totals_text']              = 'Значение';

// Entry/Text FT
$_['entry_general_ft']              = 'Основные значения';
$_['text_order_id_ft']              = '№ заказа';
$_['text_store_name_ft']            = 'Название магазина';
$_['text_logo_ft']                  = 'Логотип магазина';
$_['text_order_status_ft']          = 'Статус заказа';
$_['text_order_link_ft']            = 'Ссылка на заказ в личном кабинете покупателя';
$_['text_comment_ft']               = 'Комментарий покупателя к заказу';
$_['text_admin_comment_ft']         = 'Комментарий администратора к заказу';
$_['text_ip_ft']                    = 'IP адрес покупателя';
$_['text_ip_region']                = 'Местоположение покупателя';
$_['text_date_added_ft']            = 'Дата и время добавления заказа';
$_['text_date_modified_ft']         = 'Дата и время изменения заказа';
$_['text_firstname_ft']             = 'Имя Отчество покупателя';
$_['text_lastname_ft']              = 'Фамилия покупателя';
$_['text_group_ft']                 = 'Группа покупателя';
$_['text_email_ft']                 = 'e-mail покупателя';
$_['text_telephone_ft']             = 'Телефон покупателя';
$_['text_products_ft']              = 'Список купленных товаров';
$_['text_totals_ft']                = 'Итоговые данные (в учете в заказе)';
$_['text_total_ft']                 = 'Итого';
$_['text_shipping_total_ft']        = 'Стоимость доставки';
$_['text_product_first_ft']         = 'Первый найденный товар в заказе';
$_['text_product_last_ft']          = 'Последний найденный товар в заказе';

$_['entry_payment_ft']              = 'Платежная информация';
$_['text_payment_firstname_ft']     = 'Имя Отчество покупателя';
$_['text_payment_lastname_ft']      = 'Фамилия покупателя';
$_['text_payment_company_ft']       = 'Компания';
$_['text_payment_address_1_ft']     = 'Адрес';
$_['text_payment_address_2_ft']     = 'Адрес (продолжение)';
$_['text_payment_city_ft']          = 'Город';
$_['text_payment_postcode_ft']      = 'Почтовый индекс';
$_['text_payment_country_ft']       = 'Страна';
$_['text_payment_zone_ft']          = 'Регион / Область';
$_['text_payment_method_ft']        = 'Метод оплаты';

$_['entry_shipping_ft']             = 'Данные доставки';
$_['text_shipping_firstname_ft']    = 'Имя Отчество покупателя';
$_['text_shipping_lastname_ft']     = 'Фамилия покупателя';
$_['text_shipping_company_ft']      = 'Компания';
$_['text_shipping_address_1_ft']    = 'Адрес';
$_['text_shipping_address_2_ft']    = 'Адрес (продолжение)';
$_['text_shipping_city_ft']         = 'Город';
$_['text_shipping_postcode_ft']     = 'Почтовый индекс';
$_['text_shipping_country_ft']      = 'Страна';
$_['text_shipping_zone_ft']         = 'Регион / Область';
$_['text_shipping_method_ft']       = 'Метод доставки';

$_['entry_simple_fields_ft']        = 'Пользовательские поля SIMPLE ("Регистрация и быстрый заказ Simple")';

$_['entry_others_ft']               = 'Значения сторонних модулей';
$_['text_trackcode_ft']             = 'трек-номер посылки';
$_['text_trackcode_link_ft']        = 'Ссылка на отслеживание посылки по трек-номеру в сервисе gdeposylka.ru';
$_['text_trackcode_link2_ft']       = 'Ссылка на отслеживание посылки по трек-номеру в сервисе moyaposylka.ru';

// Entry
$_['entry_status']                  = 'Статус:';
$_['entry_admin_status']            = 'Статус:';
$_['entry_chkbox_notify']           = 'Учитывать состояние флажка "Уведомить покупателя" (только в "<a href="%s" target="_blank">Продажи -> Заказы -> Просмотр -> История</a>"):';
$_['entry_subject']                 = 'Тема письма:';
$_['entry_content']                 = 'Шаблон письма:';
$_['entry_current_order_status']    = 'Настройки шаблона писем покупателям для статуса заказов \'%s\'';
$_['entry_admin_current_order_status']  = 'Настройки шаблона писем администратору(-ам) для статуса заказов \'%s\'';
$_['entry_new_order']               = 'Настройки шаблона писем покупателям для новых заказов';
$_['entry_admin_new_order']         = 'Настройки шаблона писем администратору(-ам) для новых заказов';
$_['entry_products_ft']             = 'Структура переменной {products}';
$_['entry_products_header_ft']      = 'Структура суб-переменной {products_header}';
$_['entry_products_footer_ft']      = 'Структура суб-переменной {products_footer}';
$_['entry_totals_ft']               = 'Структура переменной {totals}';
$_['entry_totals_header_ft']        = 'Структура суб-переменной {totals_header}';
$_['entry_totals_footer_ft']        = 'Структура суб-переменной {totals_footer}';
$_['entry_product_first_ft']        = 'Структура переменной {product_first}';
$_['entry_product_last_ft']         = 'Структура переменной {product_last}';

// Help
$_['help_status']                   = 'Если статус выключен, то шаблон письма покупателям для этого статуса заказа не будет задействован.';
$_['help_admin_status']             = 'Если статус выключен, то шаблон письма администратору(-ам) для этого статуса заказа не будет задействован.';
$_['help_chkbox_notify']            = 'Когда данная опция включена, то в \'Продажи->Заказы->Просмотр->История\' при смене статуса заказа на статус \'%s\' - письма для данного статуса будут отправляться, если флажок \'Уведомить покупателя\' установлен. В противном случае отправка письма будет проигнорирована. Если опция выключена - отправка письма будет происходить не зависимо от состоянии флажка \'Уведомить покупателя\'.';
$_['help_subject']                  = 'Тема письма для статуса заказа \'%s\'. Поддерживается FastTemplate';
$_['help_content']                  = 'Шаблон письма для статуса заказа \'%s\'. Поддерживается FastTemplate';
$_['help_new_status']               = 'Если статус выключен, то шаблон письма покупателям для новых заказов не будет задействован. Вместо этого будет отправляться стандартное письмо о новом заказе';
$_['help_admin_new_status']         = 'Если статус выключен, то шаблон письма администратору(-ам) для новых заказов не будет задействован. Вместо этого будет отправляться стандартное письмо о новом заказе';
$_['help_new_subject']              = 'Тема письма для новых заказов. Поддерживается FastTemplate';
$_['help_new_content']              = 'Шаблон письма для новых заказов. Поддерживается FastTemplate';
$_['help_on_ckeditor']              = 'Двойной клик по полю переведет textarea в визуальный редактор (ckeditor)';
$_['help_list_helper']              = 'Показать/скрыть список возможных значений';
$_['help_products_ft']              = 'Здесь Вы можете настроить вывод переменной {products} в нужном виде. Если Вы добавляете новый столбец в таблице - не забудьте скорректировать соответствующим образом, при необходимости, субпеременные {products_header} и {products_footer} в настройках ниже. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_products_header_ft']       = 'Здесь Вы можете настроить суб-переменную {products_header}. Она используется для заголовков таблицы товаров переменной {products}. Использование CSS-стилей для таблицы товаров в теге \'style\' и прилинковка css-файлов не рекомендуется, т.к. некоторые почтовые сервисы (например, Яндекс.Почта) с ними не будут работать. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_products_footer_ft']       = 'Cуб-переменная {products_footer} используется для закрытия таблицы товаров {products}. Вы можете здесь добавить дополнительную информацию, если она необходима в конце таблицы. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_totals_ft']                = 'Здесь Вы можете настроить вывод переменной {totals} в нужном виде. Если Вы добавляете новый столбец в таблице - не забудьте скорректировать соответствующим образом, при необходимости, субпеременные {totals_header} и {totals_footer} в настройках ниже. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_totals_header_ft']         = 'Здесь Вы можете настроить суб-переменную {totals_header}. Она используется для заголовков таблицы итоговых данных {totals}. Использование CSS-стилей для таблицы итоговых данных в теге \'style\' и прилинковка css-файлов не рекомендуется, т.к. некоторые почтовые сервисы (например, Яндекс.Почта) с ними не будут работать. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_totals_footer_ft']         = 'Cуб-переменная {totals_footer} используется для закрытия таблицы итоговых данных {totals}. Вы можете здесь добавить дополнительную информацию, если она необходима в конце таблицы. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_product_first_ft']         = 'Здесь Вы можете настроить вывод переменной {product_first} в нужном виде. Она используется для вывода в шаблон письма информации о первом найденном в заказе товаре. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_product_last_ft']          = 'Здесь Вы можете настроить вывод переменной {product_last} в нужном виде. Она используется для вывода в шаблон письма информации о последнем найденном в заказе товаре. Вы в любой момент можете воспользоваться кнопкой \'Восстановить по умолчанию\' для восстановления \'дефолтной настройки\'';
$_['help_button_default']           = 'Восстанавливает значения по умолчанию для этих полей. Не сохраненные изменения этих полей будут утеряны. Данная кнопка полезна, если Вы хотите восстановить значения полей по умолчанию.';

//lic
$_['text_get_key']    = 'Если Вы не знаете как получить лицензионный ключ - прочтите <a href="http://opencart.shoputils.ru/license_key" target="_blank">инструкцию на нашем официальном сайте</a>.<br />Ваш домен: <b>%s</b>';
$_['entry_key']       = 'Введите лицензионный ключ:';
$_['error_loader']    = '<span style="color:red;">Отсутствует IonCube Loader!</span><br />Обратитесь к Вашему хостеру с просьбой установить IonCube Loader<br /><br />';
$_['error_key']       = 'Недействительный лицензионный ключ!';
$_['error_dir_perm']  = 'Директория "%s" не доступна для записи. Установите необходимые права!';

//Error
$_['error_permission']    = 'У Вас нет прав для управления модулем "%s"!';
$_['error_form']        = 'Необходимо заполнить поле "%s" для статуса заказов "%s"!';
?>