<?php

// Heading

$_['heading_title']        = 'Ваш заказ отправлен!';



// Text

$_['text_basket']          = 'Корзина';

$_['text_checkout']        = 'Оформить заказ';

$_['text_success']         = 'Операция выполнена успешно';

$_['text_customer']        = '<p>Наш менеджер свяжется с Вами в рабочее время<br/>(пн.-пт. с 9:00-18:00) в течении 15 минут.</p><p>Если у Вас возник срочный вопрос, позвоните по номеру <br> (044) 390-20-40 или <a href="%s#contact">напишите нам письмо.</a></p><p>Спасибо за доверие к интернет-магазину FAKRO!</p>';

$_['text_guest']           = '<p>Наш менеджер свяжется с Вами в рабочее время<br/>(пн.-пт. с 9:00-18:00) в течении 15 минут.</p><p>Если у Вас возник срочный вопрос, позвоните по номеру <br> (044) 390-20-40 или <a href="%s#contact">напишите нам письмо.</a></p><p>Спасибо за доверие к интернет-магазину FAKRO!</p>';
